; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v3 - type_3 ?v7 - type_2)
 	      (pred_3 ?v5 - object ?v7 - type_2)
	      (pred_1 ?v3 - type_3 ?v8 - type_1)
	      (pred_2 ?v3 - type_3 ?v5 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v3 - type_3 ?v4 ?v2 - type_2)
       :precondition (and  (pred_4 ?v3 ?v4))
       :effect (and  (pred_4 ?v3 ?v2)
		     (not (pred_4 ?v3 ?v4))))

   (:action op_1
       :parameters (?v3 - type_3 ?v6 - object ?v1 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v1) (pred_4 ?v3 ?v1) (pred_1 ?v3 ?v8))
       :effect (and (pred_2 ?v3 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v1)) 
		    (not (pred_1 ?v3 ?v8))))

   (:action op_3
       :parameters (?v3 - type_3 ?v6 - object ?v1 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v6 ?v8) (pred_4 ?v3 ?v1))
       :effect (and (pred_3 ?v6 ?v1)
		    (pred_1 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_3
obj_09 obj_14 obj_08 obj_12 - type_1
obj_02 obj_05 obj_07 obj_04 - type_2
obj_03 obj_11 obj_13 obj_01 - object)
(:init
(pred_4 obj_06 obj_02)
(pred_1 obj_06 obj_09)
(pred_1 obj_06 obj_14)
(pred_4 obj_10 obj_04)
(pred_1 obj_10 obj_08)
(pred_1 obj_10 obj_12)
(pred_3 obj_03 obj_05)
(pred_3 obj_11 obj_05)
(pred_3 obj_13 obj_07)
(pred_3 obj_01 obj_07)
)
(:goal
(and
(pred_3 obj_03 obj_04)
(pred_3 obj_11 obj_04)
(pred_3 obj_13 obj_02)
(pred_3 obj_01 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_06 obj_05) (pred_4 obj_10 obj_05))))
    (always (not (and (pred_4 obj_06 obj_04) (pred_4 obj_10 obj_04))))
  )
)
)

; plan
1. (op_2 obj_06 obj_02 obj_07)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_07)
   goals met: 0 of 4
2. (op_2 obj_10 obj_04 obj_07)
   deleted: (pred_4 obj_10 obj_04)
   added: (pred_4 obj_10 obj_07)
   goals met: 0 of 4
3. (op_1 obj_06 obj_01 obj_07 obj_14)
   deleted: (pred_3 obj_01 obj_07) (pred_1 obj_06 obj_14)
   added: (pred_2 obj_06 obj_01 obj_14)
   goals met: 0 of 4
4. (op_1 obj_06 obj_13 obj_07 obj_09)
   deleted: (pred_3 obj_13 obj_07) (pred_1 obj_06 obj_09)
   added: (pred_2 obj_06 obj_13 obj_09)
   goals met: 0 of 4
5. (op_2 obj_10 obj_07 obj_05)
   deleted: (pred_4 obj_10 obj_07)
   added: (pred_4 obj_10 obj_05)
   goals met: 0 of 4
6. (op_2 obj_06 obj_07 obj_02)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_02)
   goals met: 0 of 4
7. (op_1 obj_10 obj_11 obj_05 obj_12)
   deleted: (pred_3 obj_11 obj_05) (pred_1 obj_10 obj_12)
   added: (pred_2 obj_10 obj_11 obj_12)
   goals met: 0 of 4
8. (op_1 obj_10 obj_03 obj_05 obj_08)
   deleted: (pred_3 obj_03 obj_05) (pred_1 obj_10 obj_08)
   added: (pred_2 obj_10 obj_03 obj_08)
   goals met: 0 of 4
9. (op_2 obj_10 obj_05 obj_04)
   deleted: (pred_4 obj_10 obj_05)
   added: (pred_4 obj_10 obj_04)
   goals met: 0 of 4
10. (op_3 obj_06 obj_13 obj_02 obj_09)
   deleted: (pred_2 obj_06 obj_13 obj_09)
   added: (pred_3 obj_13 obj_02) (pred_1 obj_06 obj_09)
   goals met: 1 of 4
11. (op_2 obj_06 obj_02 obj_05)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 4
12. (op_3 obj_10 obj_11 obj_04 obj_12)
   deleted: (pred_2 obj_10 obj_11 obj_12)
   added: (pred_3 obj_11 obj_04) (pred_1 obj_10 obj_12)
   goals met: 2 of 4
13. (op_3 obj_10 obj_03 obj_04 obj_08)
   deleted: (pred_2 obj_10 obj_03 obj_08)
   added: (pred_3 obj_03 obj_04) (pred_1 obj_10 obj_08)
   goals met: 3 of 4
14. (op_3 obj_06 obj_01 obj_05 obj_14)
   deleted: (pred_2 obj_06 obj_01 obj_14)
   added: (pred_3 obj_01 obj_05) (pred_1 obj_06 obj_14)
   goals met: 4 of 4
